---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AdjustEdgeTooShortErr
source: html/f88c9ffa-ba91-c5d4-681b-6e7fdfff46c4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AdjustEdgeTooShortErr Property

AdjustEdge is too short - continuable error version.

## Syntax (C#)
```csharp
public static FailureDefinitionId AdjustEdgeTooShortErr { get; }
```